package com.javarush.test.level03.lesson12.home02;

/* Я не хочу изучать Java, я хочу большую зарплату
Вывести на экран десять раз надпись «Я не хочу изучать Java, я хочу большую зарплату»
*/

import java.io.BufferedReader;
import java.io.InputStreamReader;

public class Solution
{
    public static void main(String[] args) throws Exception
    {
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
        System.out.println("Я не хочу изучать Java, я хочу большую зарплату");
    }
}
